zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F81xxx/MC56F81668/codewarrior/MC56F81668_Vectors.c
/******************* Default ISR for TMRA_3 **********************/

/* User could redefine ivINT_TMRA_3.
Please be noted that ivINT_TMRA_3 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_TMRA_3 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_TMRA_3(void);
__attribute__((weak)) void ivINT_TMRA_3(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for TMRA_2 **********************/

/* User could redefine ivINT_TMRA_2.
Please be noted that ivINT_TMRA_2 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_TMRA_2 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_TMRA_2(void);
__attribute__((weak)) void ivINT_TMRA_2(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for TMRA_1 **********************/

/* User could redefine ivINT_TMRA_1.
Please be noted that ivINT_TMRA_1 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_TMRA_1 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_TMRA_1(void);
__attribute__((weak)) void ivINT_TMRA_1(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for TMRA_0 **********************/

/* User could redefine ivINT_TMRA_0.
Please be noted that ivINT_TMRA_0 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_TMRA_0 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_TMRA_0(void);
__attribute__((weak)) void ivINT_TMRA_0(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for ADC_CC1 **********************/

/* User could redefine ivINT_ADC_CC1.
Please be noted that ivINT_ADC_CC1 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_ADC_CC1 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_ADC_CC1(void);
__attribute__((weak)) void ivINT_ADC_CC1(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for ADC_CC0 **********************/

/* User could redefine ivINT_ADC_CC0.
Please be noted that ivINT_ADC_CC0 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_ADC_CC0 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_ADC_CC0(void);
__attribute__((weak)) void ivINT_ADC_CC0(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for ADC_ERR **********************/

/* User could redefine ivINT_ADC_ERR.
Please be noted that ivINT_ADC_ERR can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_ADC_ERR definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_ADC_ERR(void);
__attribute__((weak)) void ivINT_ADC_ERR(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for DMA_ERR **********************/
/* Double weak ISR mechanism for DMA_ERR to facilitate SDK usage. */

/* User could redefine the DMA_ERR_DriverIRQHandler as normal function to implement their own ISR. */
__attribute__((weak)) static void DMA_ERR_DriverIRQHandler(void)
{
    default_interrupt();
}

/* User could redefine ivINT_DMA_ERR.
Please be noted that ivINT_DMA_ERR can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_DMA_ERR definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_DMA_ERR(void);
__attribute__((weak)) void ivINT_DMA_ERR(void)
{
    DMA_ERR_DriverIRQHandler();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for DMACH3 **********************/
/* Double weak ISR mechanism for DMACH3 to facilitate SDK usage. */

/* User could redefine the DMACH3_DriverIRQHandler as normal function to implement their own ISR. */
__attribute__((weak)) static void DMACH3_DriverIRQHandler(void)
{
    default_interrupt();
}

/* User could redefine ivINT_DMACH3.
Please be noted that ivINT_DMACH3 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_DMACH3 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_DMACH3(void);
__attribute__((weak)) void ivINT_DMACH3(void)
{
    DMACH3_DriverIRQHandler();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for DMACH2 **********************/
/* Double weak ISR mechanism for DMACH2 to facilitate SDK usage. */

/* User could redefine the DMACH2_DriverIRQHandler as normal function to implement their own ISR. */
__attribute__((weak)) static void DMACH2_DriverIRQHandler(void)
{
    default_interrupt();
}

/* User could redefine ivINT_DMACH2.
Please be noted that ivINT_DMACH2 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_DMACH2 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_DMACH2(void);
__attribute__((weak)) void ivINT_DMACH2(void)
{
    DMACH2_DriverIRQHandler();
}
#pragma interrupt off
/********************************************************************/

